"""题目描述
考试题目和要点：
1、中文大写金额数字前应标明“人民币”字样。中文大写金额数字应用壹、贰、叁、肆、伍、陆、柒、捌、玖、拾、佰、仟、
万、亿、元、角、分、零、整等字样填写。（30分）
2、中文大写金额数字到“元”为止的，在“元”之后，应写“整字，如￥ 532.00应写成“人民币伍佰叁拾贰元整”。
   在”角“和”分“后面不写”整字。（30分）
3、阿拉伯数字中间有“0”时，中文大写要写“零”字，阿拉伯数字中间连续有几个“0”时，中文大写金额中间只写一个“零”字，
   如￥6007.14，应写成“人民币陆仟零柒元壹角肆分“。"""

while True:
    try:
        rmb = input().split(".")
        n = rmb[0]
        m = rmb[1]

        x = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
        y = ["零", "壹", "贰", "叁", "肆", "伍", "陆", "柒", "捌", "玖"]
        z = ["元", "拾", "佰", "仟", "万", "拾", "佰", "仟", "亿", "拾", "佰", "仟"]
        t = ["角", "分"]

        result_b = ""
        for i in range(len(m)):
            if m[i] == "0":
                continue
            b = y[int(m[i])] + t[i]
            result_b += b

        result_a = "人民币"
        n = n[::-1]
        for i in range(len(n))[::-1]:
            if n[i] == "0":
                result_a += "零"
            else:
                a = y[int(n[i])] + z[i]
                result_a += a

        s = result_a
        s = s.replace("零零", "零")
        s = s.replace("人民币零", "人民币")
        s = s.replace("壹拾", "拾")
        if result_b:
            print(s + result_b)
        else:
            print(s + "整")
    except:
        break
